//자료형 이해하기
//자바스크립트에는 크게 두 가지 타입의 자료형이 있다, 원시타입과 참조 타입이 그것이다
/*원시타입; 값이 변수에 할당 될 때 메모리 상에 고정된 크기로 저장되는 것.
            원시타입에는 숫자형,불린형,문자형,심볼형,null,undefined등이 있다
            *심볼형은 ES6부터 추가된 원시 자료형. 다른 원시형가 다르게 유일하게 변경 불가능한 자료형으로, 참조형의 키로 주로 사용됨. 차후 설명.
            *null과 undefined: null은 빈값을 의미하고, undeifned는 존재하지 않는 값을 의미한다. 이 둘의 차이는 차후 설명.
*/
/*참조 타입; 원시 타입과 달리 변수에 고정된 크기를 저장하지 않고, 값의 메모리 주소를 참조하는 것.
            참조 타입의 객체는 속성들의 집합을 의미한다. 집합의 내부에는 순서나 크기가 고정되어 있지 않다.            
            고정되지 않은 값을 변수에 할당하려면 직접 값을 저장할 수 없으나 참조하는 것만은 가능하다.
            따라서, 참조 타입은 값의 메모리 주소를 변수에 할당하여 값을 참조한다.
            *객체; 객체는 {} 안에 '키:값' 형태로 이루어진 속성들의 모음이다. 여기서 키는 반드시 문자(String) 자료형이어야 하며,
            이 속성 키를 통해 해당 속성에 매핑된 값에 접근가능하게 된다.

            *자바스크립트는 객체의 특성에 따라 여러 형태의 객체들로 나누어질 수 있음. 차후에 설명.
*/
